src/Mobile/Android/AndroidOverview.org
#+TITLE: Android Overview
#+SETUPFILE: ~/.emacs.d/src/org-templates/level-2.org

* Overview
+ http://source.android.com/index.html
+ http://wiki.cyanogenmod.com/wiki/Main_Page
+ http://blog.jobbole.com/1458/
+ [[http://www.importnew.com/3988.html][Android开发者必知的开发资源]]

* 移动开发框架
** PhoneGap

官方网站与支持配套
http://phonegap.com/
http://phonegap.com/tools/?sort=newest

与Rails的配合，可参考PhoneGap rails

点评：最轻型，目前使用也最广泛。通过jquery，CoffeeScript的搭配，将放大产品本身的价值。

** Titanium

官方网站
http://www.appcelerator.com/

点评：需要放弃自己不少东西，去适应对方。有些重了，目前IDE也出来了。但开发者社群逐步起来了。

** RhoMobile

官方网站
http://www.motorola.com/Business/US-EN/Business+Product+and+Services/Software+and+Applications/RhoMobile+Suite


点评：很适合企业应用开发，理念很先进。Rails程序员上手很快。可惜产品细节做得不够好。

以上三者更适合开发ios应用，现在介绍的是更适合开发游戏应用。

** CoronaSDK

官方网站
http://www.coronalabs.com/products/corona-sdk/
点评：通过lua语言来设计，使用简易性一般。

** ＧameSalaz

官方网站
http://gamesalad.com/
点评：宣称适合每个人的开发工具。但较封闭。

http://www.yangzhiping.com/tech/app-dev.html
