public_html/Mobile/Android/AndroidOverview.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Android Overview</title>
<!-- 2017-04-17 Mon 21:14 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Shi Shougang" />
<link href="../../assets/bootstrap.min.css" rel="stylesheet" media="screen">
<link href="../../assets/bootstrap-responsive.min.css" rel="stylesheet">
<link rel="stylesheet" type="text/css" href="../../assets/stylesheet.css" />
</head>
<body>
<div id="content">
<h1 class="title">Android Overview</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Overview</a></li>
<li><a href="#sec-2">2. 移动开发框架</a>
<ul>
<li><a href="#sec-2-1">2.1. PhoneGap</a></li>
<li><a href="#sec-2-2">2.2. Titanium</a></li>
<li><a href="#sec-2-3">2.3. RhoMobile</a></li>
<li><a href="#sec-2-4">2.4. CoronaSDK</a></li>
<li><a href="#sec-2-5">2.5. ＧameSalaz</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Overview</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="http://source.android.com/index.html">http://source.android.com/index.html</a>
</li>
<li><a href="http://wiki.cyanogenmod.com/wiki/Main_Page">http://wiki.cyanogenmod.com/wiki/Main_Page</a>
</li>
<li><a href="http://blog.jobbole.com/1458/">http://blog.jobbole.com/1458/</a>
</li>
<li><a href="http://www.importnew.com/3988.html">Android开发者必知的开发资源</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 移动开发框架</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> PhoneGap</h3>
<div class="outline-text-3" id="text-2-1">
<p>
官方网站与支持配套
<a href="http://phonegap.com/">http://phonegap.com/</a>
<a href="http://phonegap.com/tools/?sort=newest">http://phonegap.com/tools/?sort=newest</a>
</p>

<p>
与Rails的配合，可参考PhoneGap rails
</p>

<p>
点评：最轻型，目前使用也最广泛。通过jquery，CoffeeScript的搭配，将放大产品本身的价值。
</p>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Titanium</h3>
<div class="outline-text-3" id="text-2-2">
<p>
官方网站
<a href="http://www.appcelerator.com/">http://www.appcelerator.com/</a>
</p>

<p>
点评：需要放弃自己不少东西，去适应对方。有些重了，目前IDE也出来了。但开发者社群逐步起来了。
</p>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> RhoMobile</h3>
<div class="outline-text-3" id="text-2-3">
<p>
官方网站
<a href="http://www.motorola.com/Business/US-EN/Business+Product+and+Services/Software+and+Applications/RhoMobile+Suite">http://www.motorola.com/Business/US-EN/Business+Product+and+Services/Software+and+Applications/RhoMobile+Suite</a>
</p>


<p>
点评：很适合企业应用开发，理念很先进。Rails程序员上手很快。可惜产品细节做得不够好。
</p>

<p>
以上三者更适合开发ios应用，现在介绍的是更适合开发游戏应用。
</p>
</div>
</div>

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> CoronaSDK</h3>
<div class="outline-text-3" id="text-2-4">
<p>
官方网站
<a href="http://www.coronalabs.com/products/corona-sdk/">http://www.coronalabs.com/products/corona-sdk/</a>
点评：通过lua语言来设计，使用简易性一般。
</p>
</div>
</div>

<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> ＧameSalaz</h3>
<div class="outline-text-3" id="text-2-5">
<p>
官方网站
<a href="http://gamesalad.com/">http://gamesalad.com/</a>
点评：宣称适合每个人的开发工具。但较封闭。
</p>

<p>
<a href="http://www.yangzhiping.com/tech/app-dev.html">http://www.yangzhiping.com/tech/app-dev.html</a>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Shi Shougang</p>
<p class="date">Created: 2017-04-17 Mon 21:14</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
